In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

### 문제 1.a

In [2]:
iris = sns.load_dataset('iris')
iris_stats = iris.groupby(iris.species).describe()
iris_stats

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

### 문제 1.b

In [ ]:
# pd.DataFrame({'species':['setosa']*4, 'mean':iris[iris['species']=='setosa'].mean(), 'std':iris[iris['species']=='setosa'].std()}).reset_index()

In [4]:
setosa = iris.loc[iris.species == 'setosa', :]
versi = iris.loc[iris.species == 'versicolor', :]
virgin = iris.loc[iris.species == 'virginica', :]

In [37]:
def abn(x):
    q1, q3 = np.percentile(x, [25, 75])
    iqr = q3 - q1
    low_bound = q1 - iqr * 1.5
    high_bound = q3 + iqr * 1.5
    x[(x > high_bound) | (x < low_bound)] = np.NaN
    return x
def get_mean(li):
    means = []
    for col in li:
        t_mean = col.mean()
        means.append(t_mean)
    return means
def get_std(li):
    stds = []
    for col in li:
        t_std = col.std()
        stds.append(t_std)
    return stds

In [40]:
s_cols = [setosa.sepal_length, setosa.sepal_width, setosa.petal_length, setosa.petal_width]
ve_cols = [versi.sepal_length, versi.sepal_width, versi.petal_length, versi.petal_width]
vi_cols = [virgin.sepal_length, virgin.sepal_width, virgin.petal_length, virgin.petal_width]
keys = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width']
s_mean = get_mean(s_cols)
s_std = get_std(s_cols)
ve_mean = get_mean(ve_cols)
ve_std = get_std(ve_cols)
vi_mean = get_mean(vi_cols)
vi_std = get_std(vi_cols)
s_mean_dict = dict(zip(keys, s_mean))
s_std_dict = dict(zip(keys, s_std))
ve_mean_dict = dict(zip(keys, ve_mean))
ve_std_dict = dict(zip(keys, ve_std))
vi_mean_dict = dict(zip(keys, vi_mean))
vi_std_dict = dict(zip(keys, vi_std))

{'sepal_length': 5.005999999999999,
 'sepal_width': 3.4312500000000004,
 'petal_length': 1.4608695652173913,
 'petal_width': 0.23333333333333328}

In [42]:
pd.DataFrame(s_mean_dict, index=['setosa'])

        sepal_length  sepal_width  petal_length  petal_width
setosa         5.006      3.43125       1.46087     0.233333

In [7]:
new_setosa = pd.DataFrame({'sepal_length':abn(setosa.sepal_length),
                           'sepal_width': abn(setosa.sepal_width),
                           'petal_length': abn(setosa.petal_length),
                           'petal_width': abn(setosa.petal_width),
                           'species': ['setosa'] * 50})
set_cols = [new_setosa.sepal_length, new_setosa.sepal_width, new_setosa.petal_length, new_setosa.petal_width]
setosa_mean = get_mean(set_cols)
setosa_std = get_std(set_cols)

In [8]:
new_versi = pd.DataFrame({'sepal_length':abn(versi.sepal_length),
                          'sepal_width': abn(versi.sepal_width),
                          'petal_length': abn(versi.petal_length),
                          'petal_width': abn(versi.petal_width),
                          'species': ['versicolor'] * 50})
ver_cols = [new_versi.sepal_length, new_versi.sepal_width, new_versi.petal_length, new_versi.petal_width]
versi_mean = get_mean(ver_cols)
versi_std = get_std(ver_cols)

In [9]:
new_virgin = pd.DataFrame({'sepal_length':abn(virgin.sepal_length),
                           'sepal_width': abn(virgin.sepal_width),
                           'petal_length': abn(virgin.petal_length),
                           'petal_width': abn(virgin.petal_width),
                           'species': ['virgin'] * 50})
vir_cols = [new_virgin.sepal_length, new_virgin.sepal_width, new_virgin.petal_length, new_virgin.petal_width]
virgin_mean = get_mean(vir_cols)
virgin_std = get_std(vir_cols)

In [10]:
tmp_means = [setosa_mean, versi_mean, virgin_mean]
new_mean = sum(tmp_means, [])
tmp_stds = [setosa_std, versi_std, virgin_std]
new_std = sum(tmp_stds, [])

In [11]:
refine_iris = pd.DataFrame({
    'old_mean': old_mean,
    'old_std': old_std,
    'new_mean': new_mean,
    'new_std': new_std})
refine_iris

    old_mean   old_std  new_mean   new_std
0      5.006  0.352490  5.006000  0.352490
1      3.428  0.379064  3.431250  0.320343
2      1.462  0.173664  1.460870  0.129062
3      0.246  0.105386  0.233333  0.085883
4      5.936  0.516171  5.936000  0.516171
5      2.770  0.313798  2.770000  0.313798
6      4.260  0.469911  4.285714  0.437798
7      1.326  0.197753  1.326000  0.197753
8      6.588  0.635880  6.622449  0.593459
9      2.974  0.322497  2.955319  0.260275
10     5.552  0.551895  5.552000  0.551895
11     2.026  0.274650  2.026000  0.274650

### 연습문제 2.a

In [12]:
titanic = sns.load_dataset('titanic')

In [13]:
titanic['category1'] = titanic.apply(lambda r: 'child' if r.age < 20 else r.sex, axis=1)

In [14]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 연습문제 2.b

In [15]:
mean_age = round(titanic.age.mean(), 0)
titanic['age'] = titanic.age.fillna(mean_age)

In [16]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 연습문제 2.c

In [17]:
sur_pct = titanic.pivot_table('survived', index=['sex', 'class', 'embark_town'])
sur_pct = (sur_pct * 100).round(2)
sur_pct

                           survived
sex    class  embark_town
female First  Cherbourg       97.67
              Queenstown     100.00
              Southampton     95.83
       Second Cherbourg      100.00
              Queenstown     100.00
              Southampton     91.04
       Third  Cherbourg       65.22
              Queenstown      72.73
              Southampton     37.50
male   First  Cherbourg       40.48
              Queenstown       0.00
              Southampton     35.44
       Second Cherbourg       20.00
              Queenstown       0.00
              Southampton     15.46
       Third  Cherbourg       23.26
              Queenstown       7.69
              Southampton     12.83

In [18]:
round(titanic.groupby('sex')[['survived']].mean() * 100, 2)

        survived
sex
female     74.20
male       18.89

In [19]:
round(titanic.groupby('class')[['survived']].mean() * 100, 2)

        survived
class
First      62.96
Second     47.28
Third      24.24

In [20]:
round(titanic.groupby('embark_town')[['survived']].mean() * 100, 2)

             survived
embark_town
Cherbourg       55.36
Queenstown      38.96
Southampton     33.70

### 연습문제 2.d

In [21]:
ages = list(titanic.age)
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
titanic['age_cats'] = cats

In [22]:
round(titanic.pivot_table('survived', index=['age_cats']) * 100, 2)

          survived
age_cats
미성년자         42.42
청년           33.42
중년           42.32
장년           35.59
노년           20.00

### 연습문제 2.e

In [23]:
cats2 = pd.qcut(ages, 3, labels=['Q1', 'Q2', 'Q3'])
titanic['age_cats2'] = cats2

In [24]:
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex == 'male' else 0, axis=1)
round(titanic.pivot_table(['gender', 'survived'], index=['age_cats2']) * 100, 2)

           gender  survived
age_cats2
Q1          59.47     41.20
Q2          68.09     33.55
Q3          66.78     40.56

### 연습문제 3.a

In [25]:
mpg = sns.load_dataset('mpg')
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [26]:
mpg['hp_per_cc'] = mpg['horsepower'] / mpg['displacement']
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

### 연습문제 3.b

In [27]:
li = mpg.name.tolist()
lis = [li[i].split() for i in range(len(li))]
manu = [lis[i][0] for i in range(len(lis))]
model = [lis[i][1:] for i in range(len(lis))]
model_n = [" ".join(model[i]) for i in range(len(model))]

In [28]:
mpg['manu'] = manu
mpg['model'] = model_n
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manu,model
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076,chevy,s-10

In [29]:
del mpg['name']
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manu,model
393,27.0,4,140.0,86.0,2790,15.6,82,usa,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,0.689076,chevy,s-10

### 연습문제 3.c

In [30]:
mpg.pivot_table('mpg', index=['cylinders'])

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

### 연습문제 3.d

In [31]:
o = mpg.pivot_table('hp_per_cc', index=['origin'])
o

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

### 연습문제 3.e

In [32]:
manu_group = mpg.groupby('manu')
manu_group.count()
manu_model = manu_group.count()['model']
manu_model2 = manu_model.tolist()
p = mpg.pivot_table('mpg', index=['manu'])
p['model_count'] = manu_model2
p = p[p.model_count >= 5]
p = p.sort_values(by='mpg', ascending=False)[:5]
p

               mpg  model_count
manu
vw       39.016667            6
honda    33.761538           13
renault  32.880000            5
datsun   31.113043           23
mazda    30.860000           10